app/controllers/analise_financeiras_controller.rb

SELECT "analise_financeiras".* FROM "analise_financeiras"
---
  def index
    @analise_financeiras = AnaliseFinanceira.all

SELECT "analise_financeiras".* FROM "analise_financeiras" WHERE "analise_financeiras"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @analise_financeira = AnaliseFinanceira.find(params[:id])