app/views/ativo_circulante_financeiros/_form.html.erb

SELECT "analise_financeiras".* FROM "analise_financeiras"
---
	<br />
	<%= f.collection_select(:analise_financeira_id, AnaliseFinanceira.all, :id, :empresaAno) %>